import 'domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: "Свято-Михайловский собор",
    lat: 56.849555,
    lon: 53.205350,
    url: [
      "https://fs.tonkosti.ru/sized/f700x700/c4/7b/c47bld9e0hs08c88s40cck84s.jpg",
      "https://fs.tonkosti.ru/sized/f700x700/c4/7b/c47bld9e0hs08c88s40cck84s.jpg",
      "https://fs.tonkosti.ru/sized/f700x700/c4/7b/c47bld9e0hs08c88s40cck84s.jpg"
    ],
    details: "В первой половине XIX века среди ижевчан возникло особое почитание Архангела Михаила — святого покровителя генерал-фельдцейхмейстера великого князя Михаила Павловича — начальника всех оружейных заводов России; перед Александро-Невским собором города (1823) был построен и освящён памятник последнему.\r\n\r\nВ 1855 году на месте прежней Троицкой церкви выстроена в византийском стиле большая каменная часовня 30-метровой высоты — в честь Архангела Михаила. В 1876 году началась кампания по сбору средств на строительство на месте Михайловской часовни нового храма. В 1893 рабочие Ижевского завода приняли решение перечислять на строительство храма 1 % от зарплаты. Проектирование было поручено вятскому архитектору Ивану Чарушину, который выполнил проект за 3 года и 5850 рублей[3]. Строительный комитет в 1896 году принял решение о том, что новый сбор не должен быть больше Александро-Невского собора. В 1897 году состоялась торжественная закладка собора на Нагорной площади, основное строительство здания было завершено к 1907 году, главный престол был освящён 4 ноября того же года во имя Святого Архистратига Михаила. Из-за революционных событий дальнейшее благоустройство храма было приостановлено. 4 ноября 1915 состоялось торжественное освящение главного престола храма как бесприходной церкви Ижевского завода, приписанной к Александро-Невскому собору. Самостоятельный приход был открыт в 1917 году. Храм имел 3 престола: главный — во имя Архистратига Михаила, южный — в честь Николая Чудотворца и северный — в честь мученицы Александры[4].\r\n\r\n19 марта 1929 года Ижевский городской совет рабочих и красноармейских депутатов постановил: «Расторгнуть договоры с религиозными общинами Михайловского, Александро-Невского соборов и Покровской церкви на аренду зданий». 26 марта 1929 года собор был закрыт и опечатан представителями ижевской милиции. С 1932 по 1937 годы в здании собора располагался Областной музей краеведения ВАО. 8 апреля 1937 года СНК УАССР принял решение о сносе здания Михайловского собора (постановление было подписано 14—15 апреля 1937 года), и вскоре собор был разрушен[5].\r\n\r\nВоссоздание\r\n\r\n11 февраля 2000 года было принято совместное постановление Президиума Государственного Совета Удмуртской Республики и Правительства Удмуртской Республики, положившее начало воссозданию Свято-Михайловского собора. В мае 2004 года состоялось закладка в основание будущего собора освященного креста. Архитектор воссоздания Е. Л. Скопин\r\n\r\n16 мая 2007 года, в отдание праздника Пасхи, митрополит Ижевский и Удмуртский Николай (Шкрумко) совершил освящение нижнего храма в честь Веры, Надежды, Любови и матери их Софии.\r\n\r\n5 августа 2007 года главный престол, посвящённый Архистратигу Михаилу, был освящён Патриархом Алексием II, который совершил первую литургию в храме в присутствии президента Удмуртии Александра Волкова и иных официальных лиц[6].\r\n\r\nВ июле 2017 года Михайловскому собору присвоен статус кафедрального храма Ижевской и Удмуртской епархии.",
    type: "религия",
    wontDate: DateTime.now(),
  ),
  Sight(
    name: "Ижевский арсенал",
    lat: 56.85347592965163,
    lon: 53.21533958421023,
    url: [
      "https://fs.tonkosti.ru/sized/f700x700/dh/cd/dhcdpt6uwi8848gkk4ok0swcs.jpg",
      "https://fs.tonkosti.ru/sized/f700x700/dh/cd/dhcdpt6uwi8848gkk4ok0swcs.jpg",
      "https://fs.tonkosti.ru/sized/f700x700/dh/cd/dhcdpt6uwi8848gkk4ok0swcs.jpg",
    ],
    details: "Национальный музей Удмуртской Республики имени Кузебая Герда, или ижевский Арсенал, — один из самых больших в Удмуртии музеев с богатой экспозицией. Рядом со зданием бывшего Арсенала находится множество достопримечательностей: мемориал «Вечный огонь», памятник удмуртскому поэту Кузебаю Герду.",
    type: "музей",
    wontDate: DateTime.now(),
  ),
  Sight(
    name: "Ижевский зоопарк",
    lat: 56.86644391935107,
    lon: 53.174246956858354,
    url: [
      "https://fs.tonkosti.ru/sized/f700x700/7g/s7/7gs7uwcyackk0g0kk44w4kogo.jpg",
      "https://fs.tonkosti.ru/sized/f700x700/7g/s7/7gs7uwcyackk0g0kk44w4kogo.jpg",
      "https://fs.tonkosti.ru/sized/f700x700/7g/s7/7gs7uwcyackk0g0kk44w4kogo.jpg",
    ],
    details: "Ижевский зоопарк – одна из главных достопримечательностей столицы Удмуртии. Ижевский зоопарк считается одним из самых крупных и богатых в Приволжье. Общая площадь зоопарка составляет целых 16 гектаров.",
    type: "развлечения",
    visitDate: DateTime.now(),
    wontDate: DateTime.now(),
  ),
];