import 'domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: "Свято-Михайловский собор",
    lat: 56.849555,
    lon: 53.205350,
    url: "https://tonkosti.ru/Свято-Михайловский_собор_в_Ижевске",
    details: "Свято-Михайловский собор, расположенный в Центральном районе Ижевска, считается визитной карточкой города и символом возрождения духовной жизни Удмуртии и всей России.",
    type: "религия",
  ),
  Sight(
    name: "Ижевский арсенал",
    lat: 56.849555,
    lon: 53.205350,
    url: "https://tonkosti.ru/Ижевский_арсенал",
    details: "Национальный музей Удмуртской Республики имени Кузебая Герда, или ижевский Арсенал, — один из самых больших в Удмуртии музеев с богатой экспозицией. Рядом со зданием бывшего Арсенала находится множество достопримечательностей: мемориал «Вечный огонь», памятник удмуртскому поэту Кузебаю Герду.",
    type: "музей",
  ),
  Sight(
    name: "Ижевский зоопарк",
    lat: 56.849555,
    lon: 53.205350,
    url: "https://tonkosti.ru/Ижевский_зоопарк",
    details: "Ижевский зоопарк – одна из главных достопримечательностей столицы Удмуртии. Ижевский зоопарк считается одним из самых крупных и богатых в Приволжье. Общая площадь зоопарка составляет целых 16 гектаров.",
    type: "развлечения",
  ),
];